---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDist
source: html/caf15ece-6d86-31b6-67f7-73bb0ef09126.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDist Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDist { get; }
```